; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v9 ?v8)
             (pred_12 ?v10 ?v11)
             (pred_1 ?v9 ?v11)
             (pred_6 ?v7 ?v9 )
	     (pred_2 ?v9)
             (pred_10 ?v12)
             (pred_8 ?v10)
             (pred_4 ?v11)
             (pred_3 ?v9)
             (pred_11 ?v10)
             (pred_5 ?v9)
             (pred_7 ))



(:action op_5
:parameters (?v5 ?v6 ?v1 ?v3)
:precondition (and (pred_10 ?v5) (pred_10 ?v6) (pred_8 ?v1) (pred_4 ?v3)
          (pred_9 ?v5 ?v6) (pred_12 ?v1 ?v3)
                   (pred_1 ?v6 ?v3) (pred_2 ?v5) 
                   (pred_3 ?v6) (pred_11 ?v1))
:effect (and  (pred_5 ?v6) (not (pred_3 ?v6))))


(:action op_4
:parameters (?v5 ?v13)
:precondition (and (pred_10 ?v5) (pred_10 ?v13)
               (pred_2 ?v5) (pred_9 ?v5 ?v13) (pred_5 ?v13))
:effect (and (pred_2 ?v13) (not (pred_2 ?v5))))

(:action op_2
:parameters (?v5 ?v1)
:precondition (and (pred_10 ?v5) (pred_8 ?v1) 
                  (pred_2 ?v5) (pred_6 ?v1 ?v5) (pred_7 ))
:effect (and (pred_11 ?v1)
   (not (pred_6 ?v1 ?v5)) (not (pred_7 ))))


(:action op_3
:parameters (?v5 ?v2 ?v4)
:precondition (and (pred_10 ?v5) (pred_8 ?v2) (pred_8 ?v4)
                  (pred_2 ?v5) (pred_11 ?v4) (pred_6 ?v2 ?v5))
:effect (and (pred_11 ?v2) (pred_6 ?v4 ?v5)
        (not (pred_11 ?v4)) (not (pred_6 ?v2 ?v5))))

(:action op_1
:parameters (?v5 ?v1)
:precondition (and (pred_10 ?v5) (pred_8 ?v1) 
                  (pred_2 ?v5) (pred_11 ?v1))
:effect (and (pred_7 ) (pred_6 ?v1 ?v5) (not (pred_11 ?v1)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_13 obj_12 obj_11 obj_04 obj_10 obj_23 obj_28 obj_29 obj_22 obj_24 obj_17 obj_07 obj_21 obj_19 obj_09 obj_05 obj_20 obj_08 obj_03 obj_32 obj_02 obj_16 obj_06 obj_25 obj_30
    obj_27 obj_18 obj_26
    obj_15 obj_01 obj_14 obj_31
    )

    (:init
       (pred_7)

       (pred_10 obj_13)
       (pred_10 obj_12)
       (pred_10 obj_11)
       (pred_10 obj_04)
       (pred_10 obj_10)
       (pred_10 obj_23)
       (pred_10 obj_28)
       (pred_10 obj_29)
       (pred_10 obj_22)
       (pred_10 obj_24)
       (pred_10 obj_17)
       (pred_10 obj_07)
       (pred_10 obj_21)
       (pred_10 obj_19)
       (pred_10 obj_09)
       (pred_10 obj_05)
       (pred_10 obj_20)
       (pred_10 obj_08)
       (pred_10 obj_03)
       (pred_10 obj_32)
       (pred_10 obj_02)
       (pred_10 obj_16)
       (pred_10 obj_06)
       (pred_10 obj_25)
       (pred_10 obj_30)
       (pred_4 obj_27)
       (pred_4 obj_18)
       (pred_4 obj_26)
       (pred_8 obj_15)
       (pred_8 obj_01)
       (pred_8 obj_14)
       (pred_8 obj_31)

       (pred_9 obj_13 obj_23)
       (pred_9 obj_13 obj_12)
       (pred_9 obj_12 obj_28)
       (pred_9 obj_12 obj_11)
       (pred_9 obj_12 obj_13)
       (pred_9 obj_11 obj_29)
       (pred_9 obj_11 obj_04)
       (pred_9 obj_11 obj_12)
       (pred_9 obj_04 obj_22)
       (pred_9 obj_04 obj_10)
       (pred_9 obj_04 obj_11)
       (pred_9 obj_10 obj_24)
       (pred_9 obj_10 obj_04)
       (pred_9 obj_23 obj_17)
       (pred_9 obj_23 obj_28)
       (pred_9 obj_23 obj_13)
       (pred_9 obj_28 obj_07)
       (pred_9 obj_28 obj_29)
       (pred_9 obj_28 obj_12)
       (pred_9 obj_28 obj_23)
       (pred_9 obj_29 obj_21)
       (pred_9 obj_29 obj_22)
       (pred_9 obj_29 obj_11)
       (pred_9 obj_29 obj_28)
       (pred_9 obj_22 obj_19)
       (pred_9 obj_22 obj_24)
       (pred_9 obj_22 obj_04)
       (pred_9 obj_22 obj_29)
       (pred_9 obj_24 obj_09)
       (pred_9 obj_24 obj_10)
       (pred_9 obj_24 obj_22)
       (pred_9 obj_17 obj_05)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_23)
       (pred_9 obj_07 obj_20)
       (pred_9 obj_07 obj_21)
       (pred_9 obj_07 obj_28)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_21 obj_08)
       (pred_9 obj_21 obj_19)
       (pred_9 obj_21 obj_29)
       (pred_9 obj_21 obj_07)
       (pred_9 obj_19 obj_03)
       (pred_9 obj_19 obj_09)
       (pred_9 obj_19 obj_22)
       (pred_9 obj_19 obj_21)
       (pred_9 obj_09 obj_32)
       (pred_9 obj_09 obj_24)
       (pred_9 obj_09 obj_19)
       (pred_9 obj_05 obj_02)
       (pred_9 obj_05 obj_20)
       (pred_9 obj_05 obj_17)
       (pred_9 obj_20 obj_16)
       (pred_9 obj_20 obj_08)
       (pred_9 obj_20 obj_07)
       (pred_9 obj_20 obj_05)
       (pred_9 obj_08 obj_06)
       (pred_9 obj_08 obj_03)
       (pred_9 obj_08 obj_21)
       (pred_9 obj_08 obj_20)
       (pred_9 obj_03 obj_25)
       (pred_9 obj_03 obj_32)
       (pred_9 obj_03 obj_19)
       (pred_9 obj_03 obj_08)
       (pred_9 obj_32 obj_30)
       (pred_9 obj_32 obj_09)
       (pred_9 obj_32 obj_03)
       (pred_9 obj_02 obj_16)
       (pred_9 obj_02 obj_05)
       (pred_9 obj_16 obj_06)
       (pred_9 obj_16 obj_20)
       (pred_9 obj_16 obj_02)
       (pred_9 obj_06 obj_25)
       (pred_9 obj_06 obj_08)
       (pred_9 obj_06 obj_16)
       (pred_9 obj_25 obj_30)
       (pred_9 obj_25 obj_03)
       (pred_9 obj_25 obj_06)
       (pred_9 obj_30 obj_32)
       (pred_9 obj_30 obj_25)
       (pred_3 obj_19)
       (pred_3 obj_21)
       (pred_3 obj_29)
       (pred_3 obj_30)
       (pred_1  obj_19 obj_27)
       (pred_1  obj_21 obj_18)
       (pred_1  obj_29 obj_26)
       (pred_1  obj_30 obj_27)
       (pred_5 obj_13)
       (pred_5 obj_12)
       (pred_5 obj_11)
       (pred_5 obj_04)
       (pred_5 obj_10)
       (pred_5 obj_23)
       (pred_5 obj_28)
       (pred_5 obj_22)
       (pred_5 obj_24)
       (pred_5 obj_17)
       (pred_5 obj_07)
       (pred_5 obj_09)
       (pred_5 obj_05)
       (pred_5 obj_20)
       (pred_5 obj_08)
       (pred_5 obj_03)
       (pred_5 obj_32)
       (pred_5 obj_02)
       (pred_5 obj_16)
       (pred_5 obj_06)
       (pred_5 obj_25)

       (pred_12  obj_15 obj_27)
       (pred_12  obj_01 obj_18)
       (pred_12  obj_14 obj_26)
       (pred_12  obj_31 obj_26)
       (pred_6 obj_15 obj_03)
       (pred_6 obj_01 obj_05)
       (pred_6 obj_14 obj_02)
       (pred_6 obj_31 obj_20)
       (pred_2 obj_04)
    )

    (:goal (and
       (pred_6 obj_31 obj_07)
    ))
(:constraints
  (always (not (pred_2 obj_28)))
)
)

; plan
1. (op_4 obj_04 obj_11)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_11)
   goals met: 0 of 1
2. (op_4 obj_11 obj_12)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_12)
   goals met: 0 of 1
3. (op_4 obj_12 obj_13)
   deleted: (pred_2 obj_12)
   added: (pred_2 obj_13)
   goals met: 0 of 1
4. (op_4 obj_13 obj_23)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_23)
   goals met: 0 of 1
5. (op_4 obj_23 obj_17)
   deleted: (pred_2 obj_23)
   added: (pred_2 obj_17)
   goals met: 0 of 1
6. (op_4 obj_17 obj_07)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_07)
   goals met: 0 of 1
7. (op_4 obj_07 obj_20)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_20)
   goals met: 0 of 1
8. (op_2 obj_20 obj_31)
   deleted: (pred_6 obj_31 obj_20) (pred_7)
   added: (pred_11 obj_31)
   goals met: 0 of 1
9. (op_4 obj_20 obj_07)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_07)
   goals met: 0 of 1
10. (op_1 obj_07 obj_31)
   deleted: (pred_11 obj_31)
   added: (pred_7) (pred_6 obj_31 obj_07)
   goals met: 1 of 1
